@zliang-akamai it took a long while to narrow down the most minimal way to reproduce this issue, but I think I've narrowed it down.
Only instance where I could replicate it was when:
* Using linode_object_storage_key
* As part of a module
* Which generates bucket_access using dynamic block

I suppose at least part of this is irrelevant, but I guess you being able to replicate is the most important thing.

Anyway, here is the minimal relevant code for replication:

First, create a main terraform configuration, calling a module:
Note provider version is commented, so we are using latest (2.25.0)
``` HCL
terraform {
  required_providers {
    linode = {
      source = "linode/linode"
      # version = "2.23.1"
    }
  }
}

module "test" {
  source = "./access-key"
  
  shards_count = 6
}
```

Next, create the "access-key" module directory, containing only a single file:
``` HCL
terraform {
  required_providers {
    linode = {
      source = "linode/linode"
    }
  }
}

variable "shards_count" {
  type = number
}

resource "linode_object_storage_key" "this" {

  label = "test"
  dynamic "bucket_access" {
    
    for_each = range(var.shards_count)

    content {
      bucket_name = "test"
      region      = "us-iad-1"
      # cluster     = "us-east-1"
      permissions = "read_only"
    }
  }
}
```

That's all, run init+apply, and you shall receive my error:
``` HCL
╷
│ Error: Value Conversion Error
│
│   with module.test.linode_object_storage_key.this,
│   on access-key/main.tf line 13, in resource "linode_object_storage_key" "this":
│   13: resource "linode_object_storage_key" "this" {
│
│ An unexpected error was encountered trying to build a value. This is always an error in the provider. Please report the following to the provider developer:
│
│ Received unknown value, however the target type cannot handle unknown values. Use the corresponding `types` package type or a custom type that handles unknown values.
│
│ Path: bucket_access
│ Target Type: []objkey.BucketAccessModelEntry
│ Suggested Type: basetypes.SetValue
╵
```

Note again that the error explicitly says "This is always an error in the provider. Please report the following to the provider developer".

This is all pretty standard terraform code and functionality with for_each.
Now, uncomment the version restraint, and replace "region" with "cluster" to use the old version of the provider, and now this works:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test.linode_object_storage_key.this will be created
  + resource "linode_object_storage_key" "this" {
      + access_key = (known after apply)
      + id         = (known after apply)
      + label      = "test"
      + limited    = (known after apply)
      + secret_key = (sensitive value)

      + bucket_access {
          + bucket_name = "test"
          + cluster     = "us-east-1"
          + permissions = "read_only"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:
```

 I hope this helps, please let me know if there's anything else I can help with